# Aula 6: SQL

## Introdução

Nesta aula veremos as principais queries de consulta em sql

## Conexao no db4free via sqlalchemy

In [3]:
import yaml
import os
import sqlite3
import pandas as pd
from pandasql import sqldf

In [6]:
# importando libs necessárias
import mysql.connector

In [4]:
# Load SQL credentials
with open('credentials.yml', 'r') as file:
    credentials = yaml.load(file, Loader=yaml.FullLoader)

In [7]:
#Conectando
con = mysql.connector.connect(user=credentials['user'], 
                              password=credentials['password'],
                              host=credentials['host'],
                              database=credentials['database'],
                              port=credentials['port'])

cursor = con.cursor()

In [ ]:
query = '''
    SHOW TABLES
'''

cursor.execute(query)

In [8]:
query = '''


CREATE TABLE IF NOT EXISTS `artistas` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `nome` varchar(45) NOT NULL,
  `gravadoras_id` int(11) NOT NULL,
  `created` timestamp NULL DEFAULT NULL,
  `modified` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `nome_UNIQUE` (`nome`),
  KEY `fk_artistas_gravadoras1_idx` (`gravadoras_id`)
)
                               
'''
cursor.execute(query)

In [9]:
query = '''


INSERT INTO `artistas` (`id`, `nome`, `gravadoras_id`, `created`, `modified`) VALUES
(1, 'Mano Lima', 2, '2019-10-18 16:28:53', '2019-10-18 16:28:53'),
(2, 'Shakira', 4, '2019-10-18 16:29:46', '2019-10-18 16:29:46'),
(3, 'Luiz Marenco', 5, '2019-10-18 16:30:29', '2019-10-18 16:30:29'),
(4, 'Pedro Capó', 4, '2019-10-21 20:15:53', '2019-10-21 20:15:53'),
(5, 'Farruko', 4, '2019-10-21 20:16:19', '2019-10-21 20:16:19'),
(6, 'Alicia Keys', 4, '2019-10-21 20:16:28', '2019-10-21 20:16:28'),
(7, 'Joca Martins', 2, '2019-10-21 20:18:46', '2019-10-21 20:18:46'),
(8, 'José Cláudio Machado', 2, '2019-10-21 20:19:24', '2019-10-21 20:19:24'),
(9, 'Luis Fonsi', 4, '2019-10-21 20:23:42', '2019-10-21 20:23:42'),
(10, 'Nicky Jam', 4, '2019-10-21 20:25:48', '2019-10-21 20:25:48'),
(11, 'Enrique Iglesias', 4, '2019-10-21 20:45:55', '2019-10-21 20:45:55'),
(12, 'Gente de Zona', 4, '2019-10-21 20:46:07', '2019-10-21 20:46:07'),
(13, 'Descemer Bueno', 4, '2019-10-21 20:46:24', '2019-10-21 20:46:24'),
(14, 'Zion', 4, '2019-10-21 21:00:07', '2019-10-21 21:00:07'),
(15, 'Lennox', 4, '2019-10-21 21:00:16', '2019-10-21 21:00:16'),
(16, 'Maluma', 4, '2019-10-21 21:01:32', '2019-10-21 21:01:32'),
(17, 'Anitta', 4, '2019-10-21 21:01:43', '2019-10-21 21:01:43'),
(18, 'Mettallica', 4, '2019-10-21 21:02:34', '2019-10-21 21:02:34'),
(19, 'MC Créu', 1, '2019-10-21 21:22:44', '2019-10-21 21:22:44')
                               
'''
cursor.execute(query)

In [9]:
query = '''


INSERT INTO `artistas` (`id`, `nome`, `gravadoras_id`, `created`, `modified`) VALUES
(1, 'Mano Lima', 2, '2019-10-18 16:28:53', '2019-10-18 16:28:53'),
(2, 'Shakira', 4, '2019-10-18 16:29:46', '2019-10-18 16:29:46'),
(3, 'Luiz Marenco', 5, '2019-10-18 16:30:29', '2019-10-18 16:30:29'),
(4, 'Pedro Capó', 4, '2019-10-21 20:15:53', '2019-10-21 20:15:53'),
(5, 'Farruko', 4, '2019-10-21 20:16:19', '2019-10-21 20:16:19'),
(6, 'Alicia Keys', 4, '2019-10-21 20:16:28', '2019-10-21 20:16:28'),
(7, 'Joca Martins', 2, '2019-10-21 20:18:46', '2019-10-21 20:18:46'),
(8, 'José Cláudio Machado', 2, '2019-10-21 20:19:24', '2019-10-21 20:19:24'),
(9, 'Luis Fonsi', 4, '2019-10-21 20:23:42', '2019-10-21 20:23:42'),
(10, 'Nicky Jam', 4, '2019-10-21 20:25:48', '2019-10-21 20:25:48'),
(11, 'Enrique Iglesias', 4, '2019-10-21 20:45:55', '2019-10-21 20:45:55'),
(12, 'Gente de Zona', 4, '2019-10-21 20:46:07', '2019-10-21 20:46:07'),
(13, 'Descemer Bueno', 4, '2019-10-21 20:46:24', '2019-10-21 20:46:24'),
(14, 'Zion', 4, '2019-10-21 21:00:07', '2019-10-21 21:00:07'),
(15, 'Lennox', 4, '2019-10-21 21:00:16', '2019-10-21 21:00:16'),
(16, 'Maluma', 4, '2019-10-21 21:01:32', '2019-10-21 21:01:32'),
(17, 'Anitta', 4, '2019-10-21 21:01:43', '2019-10-21 21:01:43'),
(18, 'Mettallica', 4, '2019-10-21 21:02:34', '2019-10-21 21:02:34'),
(19, 'MC Créu', 1, '2019-10-21 21:22:44', '2019-10-21 21:22:44')
                               
'''
cursor.execute(query)

In [11]:
query = '''


CREATE TABLE IF NOT EXISTS `clientes` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `login` varchar(45) NOT NULL,
  `senha` varchar(45) NOT NULL,
  `created` timestamp NULL DEFAULT NULL,
  `modified` timestamp NULL DEFAULT NULL,
  `planos_id` int(11) NOT NULL,
  `email` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `login_UNIQUE` (`login`),
  KEY `fk_usuarios_planos1_idx` (`planos_id`)
) 
                               
'''
cursor.execute(query)

In [12]:
query = '''


INSERT INTO `clientes` (`id`, `login`, `senha`, `created`, `modified`, `planos_id`, `email`) VALUES
(1, 'Sandro', '5andr0', '2019-10-18 16:08:20', '2019-10-21 20:52:17', 1, 'sandrocamargo@unipampa.edu.br'),
(2, 'Papa', 'v5t1c5n0', '2019-10-18 16:08:51', '2019-10-21 20:52:42', 3, 'papa@vaticano.com'),
(3, 'Neymar', 'caicai', '2019-10-21 20:14:56', '2019-10-21 20:53:08', 3, 'bateu-caiu@selecao.com')
                               
'''
cursor.execute(query)

In [13]:
query = '''
CREATE TABLE IF NOT EXISTS `generos` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `descricao` varchar(45) NOT NULL,
  `created` timestamp NULL DEFAULT NULL,
  `modified` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `descricao_UNIQUE` (`descricao`)
)
                               
'''
cursor.execute(query)

In [14]:
query = '''

INSERT INTO `generos` (`id`, `descricao`, `created`, `modified`) VALUES
(1, 'Gaúcha', '2019-10-18 16:10:38', '2019-10-18 16:10:38'),
(2, 'Pop', '2019-10-18 16:10:42', '2019-10-18 16:10:42'),
(3, 'Rock', '2019-10-18 16:10:46', '2019-10-18 16:10:46'),
(4, 'Funk', '2019-10-18 16:10:49', '2019-10-18 16:10:49')            
'''
cursor.execute(query)

In [15]:
query = '''


CREATE TABLE IF NOT EXISTS `gravadoras` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `nome` varchar(45) NOT NULL,
  `valor_contrato` decimal(10,0) NOT NULL,
  `vencimento_contrato` date DEFAULT NULL,
  `created` timestamp NULL DEFAULT NULL,
  `modified` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `nome_UNIQUE` (`nome`)
)                               
'''
cursor.execute(query)

In [16]:
query = '''

INSERT INTO `gravadoras` (`id`, `nome`, `valor_contrato`, `vencimento_contrato`, `created`, `modified`) VALUES
(1, 'Artista Independente', 0, '2020-12-31', '2019-10-18 16:18:32', '2019-10-18 16:18:32'),
(2, 'ACIT', 50000, '2020-12-31', '2019-10-18 16:28:19', '2019-10-18 16:28:19'),
(3, 'Som Livre', 100000, '2020-12-31', '2019-10-18 16:28:38', '2019-10-18 16:28:38'),
(4, 'Sony Music', 500000, '2024-12-31', '2019-10-18 16:29:37', '2019-10-18 16:29:37'),
(5, 'USA Discos', 10000, '2020-12-31', '2019-10-18 16:30:21', '2019-10-18 16:30:21')'''
cursor.execute(query)

In [17]:
query = '''
CREATE TABLE IF NOT EXISTS `musicas` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `nome` varchar(45) NOT NULL,
  `duracao` time NOT NULL,
  `generos_id` int(11) NOT NULL,
  `lancamento` date DEFAULT NULL,
  `created` timestamp NULL DEFAULT NULL,
  `modified` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_musicas_generos1_idx` (`generos_id`)
)              
'''
cursor.execute(query)

In [18]:
query = '''
INSERT INTO `musicas` (`id`, `nome`, `duracao`, `generos_id`, `lancamento`, `created`, `modified`) VALUES
(1, 'Conta pro tio', '04:00:00', 1, '2014-01-01', '2019-10-18 16:31:22', '2019-10-18 16:31:22'),
(2, 'Balaio de gato', '03:05:00', 1, '2014-10-07', '2019-10-21 15:06:51', '2019-10-21 15:06:51'),
(3, 'Batendo água', '15:09:00', 1, '2014-02-06', '2019-10-21 15:09:57', '2019-10-21 15:09:57'),
(4, 'Estoy aqui', '05:00:00', 2, '2014-04-05', '2019-10-21 15:18:10', '2019-10-21 15:18:10'),
(5, 'Calma', '20:15:00', 2, '2018-12-31', '2019-10-21 20:15:36', '2019-10-21 20:15:36'),
(6, 'A boa vista do peão de tropa', '04:18:00', 1, '2014-12-31', '2019-10-21 20:18:37', '2019-10-21 20:18:37'),
(7, 'Espantando o Bagual', '04:00:00', 1, '2014-12-31', '2019-10-21 20:21:20', '2019-10-21 20:21:20'),
(8, 'Cadela Baia', '03:59:00', 1, '2014-12-31', '2019-10-21 20:22:05', '2019-10-21 20:22:05'),
(9, 'Sem paia e sem fumo', '03:59:00', 1, '2014-12-31', '2019-10-21 20:22:52', '2019-10-21 20:22:52'),
(10, 'Despacito', '04:00:00', 2, '2014-12-31', '2019-10-21 20:23:30', '2019-10-21 20:23:30'),
(11, 'Quando o verso vem pras casa', '04:00:00', 1, '2014-12-31', '2019-10-21 20:24:28', '2019-10-21 20:24:28'),
(12, 'Perro Fiel', '03:59:00', 2, '2014-12-31', '2019-10-21 20:26:15', '2019-10-21 20:26:15'),
(13, 'Bailando', '04:00:00', 2, '2014-12-31', '2019-10-21 20:46:59', '2019-10-21 20:46:59'),
(14, 'El perdón', '03:54:00', 2, '2014-12-31', '2019-10-21 20:54:37', '2019-10-21 20:54:37'),
(15, 'Súbeme la Radio', '03:30:00', 2, '2014-12-31', '2019-10-21 21:00:39', '2019-10-21 21:00:39'),
(16, 'Sim ou Não', '04:00:00', 2, '2014-12-31', '2019-10-21 21:00:48', '2019-10-21 21:02:16'),
(17, 'Felices los 4', '03:59:00', 2, '2014-12-31', '2019-10-21 21:21:54', '2019-10-21 21:21:54'),
(18, 'Dança do Créu', '01:59:00', 4, '2014-12-31', '2019-10-21 21:22:59', '2019-10-21 21:22:59')                      
'''
cursor.execute(query)

In [19]:
query = '''
CREATE TABLE IF NOT EXISTS `musicas_has_artistas` (
  `id` int(11) unsigned zerofill NOT NULL AUTO_INCREMENT,
  `musicas_id` int(11) NOT NULL,
  `artistas_id` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_musicas_has_artistas_artistas1_idx` (`artistas_id`),
  KEY `fk_musicas_has_artistas_musicas1_idx` (`musicas_id`),
  KEY `id` (`id`)
) 
'''
cursor.execute(query)

In [20]:
query = '''
INSERT INTO `musicas_has_artistas` (`id`, `musicas_id`, `artistas_id`) VALUES
(00000000001, 1, 1),
(00000000002, 2, 1),
(00000000003, 3, 3),
(00000000004, 4, 2),
(00000000005, 5, 4),
(00000000006, 5, 5),
(00000000007, 5, 6),
(00000000008, 6, 8),
(00000000009, 6, 7),
(00000000010, 6, 3),
(00000000011, 7, 1),
(00000000012, 8, 1),
(00000000013, 9, 1),
(00000000014, 10, 9),
(00000000015, 11, 3),
(00000000016, 12, 2),
(00000000017, 12, 10),
(00000000018, 13, 13),
(00000000019, 13, 11),
(00000000020, 13, 12),
(00000000021, 14, 11),
(00000000022, 14, 10),
(00000000023, 16, 17),
(00000000024, 16, 16),
(00000000025, 15, 11),
(00000000026, 15, 15),
(00000000027, 15, 14),
(00000000028, 15, 13),
(00000000029, 17, 16),
(00000000030, 18, 19)
'''
cursor.execute(query)

In [21]:
query = '''
CREATE TABLE IF NOT EXISTS `musicas_has_clientes` (
  `id` int(11) unsigned zerofill NOT NULL AUTO_INCREMENT,
  `musicas_id` int(11) NOT NULL,
  `clientes_id` int(11) NOT NULL,
  `data` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `fk_musicas_has_usuarios_musicas1_idx` (`musicas_id`),
  KEY `fk_musicas_has_usuarios_clientes1_idx` (`clientes_id`)
)
'''
cursor.execute(query)

In [22]:
query = '''
CREATE TABLE IF NOT EXISTS `pagamentos` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `data` date DEFAULT NULL,
  PRIMARY KEY (`id`)
)
'''
cursor.execute(query)

In [23]:
query = '''
CREATE TABLE IF NOT EXISTS `planos` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `descricao` varchar(45) NOT NULL,
  `valor` decimal(5,2) NOT NULL,
  `limite` int(11) NOT NULL,
  `created` timestamp NULL DEFAULT NULL,
  `modified` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `descricao_UNIQUE` (`descricao`)
)
'''
cursor.execute(query)

In [24]:
query = '''
INSERT INTO `planos` (`id`, `descricao`, `valor`, `limite`, `created`, `modified`) VALUES
(1, 'Light', 29.99, 100, '2019-10-18 14:21:08', '2019-10-18 14:21:08'),
(2, 'Sem nome', 39.99, 500, '2019-10-18 14:21:31', '2019-10-18 14:21:31'),
(3, 'Full', 49.99, 999999, '2019-10-18 14:22:00', '2019-10-18 14:22:00')
'''
cursor.execute(query)

### 1) Quantos clientes estão cadastrados?

In [25]:
query = '''
    SELECT
    COUNT(id)
FROM
    clientes;

'''
pd.read_sql(query, con)

   COUNT(id)
0          3

### 2) Quantos clientes estão cadastrados em cada plano?

In [25]:
query = '''
    SELECT
    COUNT(id)
FROM
    clientes;

'''
pd.read_sql(query, con)

   COUNT(id)
0          3

### 2) Quantos clientes estão cadastrados em cada plano?

In [26]:
query = '''
SELECT
    descricao AS 'Nome do Plano',
    COUNT(clientes.id) AS 'Quantidade'
FROM
    clientes
JOIN planos ON planos.id = clientes.planos_id
GROUP BY
    planos_id;

'''
pd.read_sql(query, con)

  Nome do Plano  Quantidade
0         Light           1
1          Full           2

### 3) Quais os artistas que estão no sistema?

In [27]:
query = '''
SELECT
    nome
FROM
    artistas;

'''
pd.read_sql(query, con)

                    nome
0            Alicia Keys
1                 Anitta
2         Descemer Bueno
3       Enrique Iglesias
4                Farruko
5          Gente de Zona
6           Joca Martins
7   José Cláudio Machado
8                 Lennox
9             Luis Fonsi
10          Luiz Marenco
11                Maluma
12             Mano Lima
13               MC Créu
14            Mettallica
15             Nicky Jam
16            Pedro Capó
17               Shakira
18                  Zion

### 4) Quais são os planos, valores e limites de downloads?

In [28]:
query = '''
SELECT
    descricao AS 'Nome Plano',
    valor,
    limite
FROM
    planos
ORDER BY
    valor;

'''
pd.read_sql(query, con)

  Nome Plano  valor  limite
0      Light  29.99     100
1   Sem nome  39.99     500
2       Full  49.99  999999

### 5) Quantos artistas tem cada gravadora?

In [29]:
query = '''
SELECT
    gravadoras.nome AS 'Gravadora',
    COUNT(artistas.id) AS 'Total de artistas'
FROM
    artistas
JOIN gravadoras ON artistas.gravadoras_id = gravadoras.id
GROUP BY
    gravadoras.id;

'''
pd.read_sql(query, con)

              Gravadora  Total de artistas
0  Artista Independente                  1
1                  ACIT                  3
2            Sony Music                 14
3            USA Discos                  1

### 6) Qual gravadora tem mais artistas?

In [33]:
query = '''
SELECT
    gravadoras.nome AS 'Gravadora',
    COUNT(artistas.id) AS 'Qtd de Artistas'
FROM
    artistas
JOIN gravadoras ON artistas.gravadoras_id = gravadoras.id
GROUP BY
    gravadoras.id
ORDER BY
    COUNT(artistas.id)
DESC
LIMIT 1

'''
pd.read_sql(query, con)

    Gravadora  Qtd de Artistas
0  Sony Music               14

### 7) Quais são as músicas do “Mano Lima”?

In [35]:
query = '''
SELECT
    DISTINCT(musicas.nome) AS 'Nome da música'
FROM
    musicas_has_artistas
JOIN artistas ON artistas.id = musicas_has_artistas.artistas_id
JOIN musicas ON musicas_id = musicas_has_artistas.musicas_id
WHERE
    artistas.nome = 'Mano Lima';

'''
pd.read_sql(query, con)

                  Nome da música
0                  Conta pro tio
1                 Balaio de gato
2                   Batendo água
3                     Estoy aqui
4                          Calma
5   A boa vista do peão de tropa
6            Espantando o Bagual
7                    Cadela Baia
8            Sem paia e sem fumo
9                      Despacito
10  Quando o verso vem pras casa
11                    Perro Fiel
12                      Bailando
13                     El perdón
14               Súbeme la Radio
15                    Sim ou Não
16                 Felices los 4
17                 Dança do Créu

### 8) Quais são as músicas da gravadora ACIT?

In [36]:
query = '''
SELECT
    gravadoras.nome AS 'Nome gravadora',
    musicas.nome AS 'Nome musica'
FROM
    musicas_has_artistas
JOIN artistas ON artistas.id = musicas_has_artistas.artistas_id
JOIN musicas ON musicas.id = musicas_has_artistas.musicas_id
JOIN gravadoras ON gravadoras.id = artistas.gravadoras_id
WHERE
    gravadoras.nome = 'ACIT'
GROUP BY
    musicas.nome;

'''
pd.read_sql(query, con)

  Nome gravadora                   Nome musica
0           ACIT                 Conta pro tio
1           ACIT                Balaio de gato
2           ACIT           Espantando o Bagual
3           ACIT                   Cadela Baia
4           ACIT           Sem paia e sem fumo
5           ACIT  A boa vista do peão de tropa

### 9) Quantas músicas tem cada gênero?

In [37]:
query = '''
SELECT
    generos.descricao AS 'Genero',
    COUNT(musicas.id) AS 'Total de músicas'
FROM
    generos
JOIN musicas ON generos.id = musicas.generos_id
GROUP BY
    generos.id;

'''
pd.read_sql(query, con)

   Genero  Total de músicas
0  Gaúcha                 8
1     Pop                 9
2    Funk                 1

### 10) Quanto vou receber DOS clientes que estão cadastrados em cada plano? Nome plano, quantidade de clientes, valor.

In [41]:
query = '''
SELECT
    planos.descricao AS 'Nome Plano',
    COUNT(clientes.id) AS 'Qtd Clientes',
    planos.valor AS 'Valor por cliente',
    planos.valor * COUNT(clientes.id) AS 'Valor total'
FROM
    planos
JOIN clientes ON clientes.planos_id = planos.id
GROUP BY
    planos.id;
'''
pd.read_sql(query, con)

  Nome Plano  Qtd Clientes  Valor por cliente  Valor total
0      Light             1              29.99        29.99
1       Full             2              49.99        99.98